hurrican/wita-acceptance-test/src/citrus/resources/templates/cdm/v2/TAL_BEREIT_NEU_12A/talBereitNeu12a.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
        xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns="http://www.mnet.de/esb/cdm/SupplierPartner/LineOrderService/v2">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <createOrder xmlns="http://www.mnet.de/esb/cdm/SupplierPartner/LineOrderService/v2">
            <order>
                <externeAuftragsnummer>${externe.auftrags.nummer}</externeAuftragsnummer>
                <kunde>
                    <kundennummer>5920312290</kundennummer>
                    <leistungsnummer>0000004364</leistungsnummer>
                </kunde>
                <geschaeftsfall>
                    <NEU>
                        <BKTOFaktura>5883000326</BKTOFaktura>
                        <ansprechpartner>
                            <auftragsmanagement>
                                <anrede>9</anrede>
                                <vorname>TestFirstName</vorname>
                                <nachname>${ansprechpartner.nachname}</nachname>
                                <telefonnummer>089 0000000</telefonnummer>
                                <emailadresse>hurrican_developer@m-net.de</emailadresse>
                            </auftragsmanagement>
                        </ansprechpartner>
                        <termine>
                            <kundenwunschtermin>
                                <datum>${kundenwunschtermin.datum}</datum>
                                <zeitfenster>9</zeitfenster>
                            </kundenwunschtermin>
                        </termine>
                        <auftragsposition>
                            <produkt
                                    xmlns:ns2="http://www.mnet.de/esb/cdm/SupplierPartner/LineOrderService/v2"
                                    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns2:ProduktTALType">
                                <kategorie>TAL</kategorie>
                                <bezeichner>TAL; CuDA 2 Draht mit ZwR</bezeichner>
                            </produkt>
                            <geschaeftsfallProdukt>
                                <TAL>
                                    <standortA>
                                        <person>
                                            <anrede>1</anrede>
                                            <vorname>Max</vorname>
                                            <nachname>Mustermann</nachname>
                                        </person>
                                        <strasse>
                                            <strassenname>Mitteldeichstr.</strassenname>
                                            <hausnummer>8</hausnummer>
                                            <hausnummernZusatz>a</hausnummernZusatz>
                                        </strasse>
                                        <land>de</land>
                                        <postleitzahl>26919</postleitzahl>
                                        <ort>
                                            <ortsname>Brake</ortsname>
                                            <ortsteil>a.d.XYZ</ortsteil>
                                        </ort>
                                        <lageTAE_ONT>Keller</lageTAE_ONT>
                                    </standortA>
                                    <standortB>
                                        <strasse>
                                            <strassenname>Georgstr.</strassenname>
                                            <hausnummer>1</hausnummer>
                                            <hausnummernZusatz>a</hausnummernZusatz>
                                        </strasse>
                                        <postleitzahl>26919</postleitzahl>
                                        <ort>
                                            <ortsname>Brake</ortsname>
                                            <ortsteil>zusatz</ortsteil>
                                        </ort>
                                        <lageKollokationsraum>
                                            <ONKZ>4401</ONKZ>
                                            <anschlussbereich>1</anschlussbereich>
                                        </lageKollokationsraum>
                                    </standortB>
                                    <uebertragungsverfahren>H04</uebertragungsverfahren>
                                    <schaltangaben>
                                        <schaltung>
                                            <kupfer>
                                                <UEVT>1PH1</UEVT>
                                                <EVS>01</EVS>
                                                <doppelader>01</doppelader>
                                            </kupfer>
                                        </schaltung>
                                    </schaltangaben>
                                </TAL>
                            </geschaeftsfallProdukt>
                        </auftragsposition>
                    </NEU>
                </geschaeftsfall>
            </order>
        </createOrder>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>